acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
#include <Arduino.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <esp_camera.h>
#include <mbedtls/base64.h>

#include <ctype.h>
#include <math.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <sys/time.h>
#include <time.h>

#include "private_config.h"

/*
  Pebble firmware for Seeeduino XIAO ESP32-S3 Sense controlling a WowWee MiP.

  MQTT follows mqtt_standard.md:
    {system}/robots/{robot_id}/{incoming|outgoing}/{metric}

  MiP UART uses the raw WowWee command bytes documented by MiP-Capi and the
  WowWee MiP BLE protocol. D6 is TX to MiP RX. D7 is RX from MiP TX.
*/

#ifndef MIP_UART_TX_PIN
#define MIP_UART_TX_PIN D6
#endif

#ifndef MIP_UART_RX_PIN
#define MIP_UART_RX_PIN D7
#endif

#ifndef MIP_UART_BAUD
#define MIP_UART_BAUD 115200UL
#endif

#ifndef MIP_UART_PROBE_ALTERNATE_BAUD
#define MIP_UART_PROBE_ALTERNATE_BAUD 1
#endif

#ifndef MIP_UART_ALTERNATE_BAUD
#define MIP_UART_ALTERNATE_BAUD 9600UL
#endif

#ifndef MIP_UART_TX_ONLY_FALLBACK_ALTERNATE
#define MIP_UART_TX_ONLY_FALLBACK_ALTERNATE 0
#endif

#ifndef MIP_UART_SPARKFUN_WAKE
#define MIP_UART_SPARKFUN_WAKE 1
#endif

#ifndef MIP_UART_APPEND_ZERO
#define MIP_UART_APPEND_ZERO 1
#endif

#ifndef MIP_TURN_INVERT
#define MIP_TURN_INVERT 0
#endif

#ifndef MQTT_PACKET_BUFFER_SIZE
#define MQTT_PACKET_BUFFER_SIZE 24576
#endif

#ifndef MQTT_KEEPALIVE_SECONDS
#define MQTT_KEEPALIVE_SECONDS 30
#endif

#ifndef DRIVE_REFRESH_MS
#define DRIVE_REFRESH_MS 50UL
#endif

#ifndef DRIVE_TIMEOUT_MS
#define DRIVE_TIMEOUT_MS 750UL
#endif

#ifndef MQTT_VIDEO_ENABLED_BY_DEFAULT
#define MQTT_VIDEO_ENABLED_BY_DEFAULT 0
#endif

#ifndef MIP_CAMERA_ENABLED
#define MIP_CAMERA_ENABLED 0
#endif

#ifndef MQTT_VIDEO_INTERVAL_MS
#define MQTT_VIDEO_INTERVAL_MS 1000UL
#endif

#ifndef CAMERA_FRAME_SIZE
#define CAMERA_FRAME_SIZE FRAMESIZE_QQVGA
#endif

#ifndef CAMERA_JPEG_QUALITY
#define CAMERA_JPEG_QUALITY 38
#endif

#ifndef MIP_CAMERA_VFLIP
#define MIP_CAMERA_VFLIP 1
#endif

#ifndef MIP_SOUND_DEFAULT_VOLUME
#define MIP_SOUND_DEFAULT_VOLUME 7
#endif

#ifndef MIP_ODOM_MAX_TURN_RADPS
#define MIP_ODOM_MAX_TURN_RADPS 2.4f
#endif

#ifndef ALLOW_REMOTE_REBOOT
#define ALLOW_REMOTE_REBOOT 1
#endif

#ifndef DEBUG_LOGS
#define DEBUG_LOGS 0
#endif

// Seeed XIAO ESP32-S3 Sense camera pin map.
#define PWDN_GPIO_NUM -1
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 10
#define SIOD_GPIO_NUM 40
#define SIOC_GPIO_NUM 39
#define Y9_GPIO_NUM 48
#define Y8_GPIO_NUM 11
#define Y7_GPIO_NUM 12
#define Y6_GPIO_NUM 14
#define Y5_GPIO_NUM 16
#define Y4_GPIO_NUM 18
#define Y3_GPIO_NUM 17
#define Y2_GPIO_NUM 15
#define VSYNC_GPIO_NUM 38
#define HREF_GPIO_NUM 47
#define PCLK_GPIO_NUM 13

namespace {

const char FIRMWARE_VERSION[] = "2026.04.10.6";
const char CAPABILITIES_SCHEMA[] = "pebble-capabilities/v1";
const char MQTT_OFFLINE_PAYLOAD[] = "{\"online\":false,\"status\":\"offline\"}";

const uint8_t MIP_CMD_PLAY_SOUND = 0x06;
const uint8_t MIP_CMD_GET_GESTURE_RESPONSE = 0x0A;
const uint8_t MIP_CMD_SET_GESTURE_RADAR_MODE = 0x0C;
const uint8_t MIP_CMD_GET_RADAR_RESPONSE = 0x0C;
const uint8_t MIP_CMD_GET_GESTURE_RADAR_MODE = 0x0D;
const uint8_t MIP_CMD_GET_SOFTWARE_VERSION = 0x14;
const uint8_t MIP_CMD_SET_VOLUME = 0x15;
const uint8_t MIP_CMD_GET_VOLUME = 0x16;
const uint8_t MIP_CMD_GET_HARDWARE_INFO = 0x19;
const uint8_t MIP_CMD_SHAKE_RESPONSE = 0x1A;
const uint8_t MIP_CMD_CLAP_RESPONSE = 0x1D;
const uint8_t MIP_CMD_GET_UP = 0x23;
const uint8_t MIP_CMD_DISTANCE_DRIVE = 0x70;
const uint8_t MIP_CMD_DRIVE_FORWARD = 0x71;
const uint8_t MIP_CMD_DRIVE_BACKWARD = 0x72;
const uint8_t MIP_CMD_TURN_LEFT = 0x73;
const uint8_t MIP_CMD_TURN_RIGHT = 0x74;
const uint8_t MIP_CMD_SET_GAME_MODE = 0x76;
const uint8_t MIP_CMD_STOP = 0x77;
const uint8_t MIP_CMD_CONTINUOUS_DRIVE = 0x78;
const uint8_t MIP_CMD_GET_STATUS = 0x79;
const uint8_t MIP_CMD_GET_WEIGHT = 0x81;
const uint8_t MIP_CMD_GET_CHEST_LED = 0x83;
const uint8_t MIP_CMD_SET_CHEST_LED = 0x84;
const uint8_t MIP_CMD_READ_ODOMETER = 0x85;
const uint8_t MIP_CMD_RESET_ODOMETER = 0x86;
const uint8_t MIP_CMD_FLASH_CHEST_LED = 0x89;
const uint8_t MIP_CMD_SET_HEAD_LEDS = 0x8A;
const uint8_t MIP_CMD_GET_HEAD_LEDS = 0x8B;

const uint8_t MIP_SOUND_SHORT_MUTE_FOR_STOP = 105;
const uint8_t MIP_SOUND_MAX_BUILTIN = 106;
const uint8_t MIP_SOUND_VOLUME_7 = 0xFE;
const uint8_t MIP_GET_UP_FROM_EITHER = 0x02;
const uint8_t MIP_GAME_MODE_APP = 0x01;

#if MQTT_USE_TLS
WiFiClientSecure wifiClient;
#else
WiFiClient wifiClient;
#endif
PubSubClient mqtt(wifiClient);

String baseTopic;
String topicDrive;
String topicLightsSolid;
String topicLightsFlash;
String topicVideoControl;
String topicVideoFlag;
String topicRebootFlag;
String topicSoundboardCommand;
String topicMipRawCommand;
String topicAutonomyCommand;
String topicHeartbeat;
String topicCapabilities;
String topicLogs;
String topicStatus;
String topicChargingLevel;
String topicChargingStatus;
String topicWheelOdometry;
String topicSoundboardFiles;
String topicSoundboardStatus;
String topicVideo;
String topicVideoOverlays;

bool timeSynced = false;
bool cameraReady = false;
bool mqttLargeBufferReady = false;
bool videoEnabled = MQTT_VIDEO_ENABLED_BY_DEFAULT;

unsigned long lastHeartbeatMs = 0;
unsigned long lastCapabilitiesMs = 0;
unsigned long lastStatusMs = 0;
unsigned long lastVideoMs = 0;
unsigned long lastDriveCommandMs = 0;
unsigned long lastDriveRefreshMs = 0;
unsigned long lastMipResponseMs = 0;
unsigned long lastOdomPollMs = 0;
unsigned long lastGetUpMs = 0;

int8_t targetVelocity = 0;
int8_t targetTurnRate = 0;
bool driveActive = false;
bool driveStoppedForTimeout = true;
uint32_t mqttMessageCount = 0;
uint32_t driveCommandCount = 0;
uint32_t lightsCommandCount = 0;
uint32_t getUpCommandCount = 0;

uint32_t mipBaud = MIP_UART_BAUD;
uint8_t mipTxPin = MIP_UART_TX_PIN;
uint8_t mipRxPin = MIP_UART_RX_PIN;
bool mipRxOk = false;
uint8_t mipPosition = 0xFF;
float mipBatteryVolts = NAN;
float mipOdometerCm = NAN;
float odomReferenceCm = NAN;
float odomLastCm = NAN;
float odomXmm = 0.0f;
float odomYmm = 0.0f;
float odomHeadingRad = 0.0f;
uint32_t odomPublishSeq = 0;
unsigned long odomLastIntegrateMs = 0;
uint8_t mipVolume = 0xFF;
char mipSoftwareVersion[24] = "";
char mipHardwareInfo[24] = "";

uint8_t lastRadar = 0;
uint8_t lastGesture = 0;
uint8_t lastClapCount = 0;
int8_t lastWeight = 0;
bool lastShake = false;
unsigned long lastRadarMs = 0;
unsigned long lastGestureMs = 0;
unsigned long lastClapMs = 0;
unsigned long lastWeightMs = 0;
unsigned long lastShakeMs = 0;

uint32_t videoFrameId = 0;
bool soundPlaying = false;
uint8_t currentSoundIndex = 0;
char currentSoundFile[40] = "";

struct SoundSpec {
  uint8_t index;
  const char *name;
};

