acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
const SoundSpec MIP_SOUNDS[] = {
  {1, "001-onekhz-500ms-8k16bit.wav"},
  {2, "002-action-burping.wav"},
  {3, "003-action-drinking.wav"},
  {4, "004-action-eating.wav"},
  {5, "005-action-farting-short.wav"},
  {6, "006-action-out-of-breath.wav"},
  {7, "007-boxing-punchconnect-1.wav"},
  {8, "008-boxing-punchconnect-2.wav"},
  {9, "009-boxing-punchconnect-3.wav"},
  {10, "010-freestyle-tracking-1.wav"},
  {11, "011-mip-1.wav"},
  {12, "012-mip-2.wav"},
  {13, "013-mip-3.wav"},
  {14, "014-mip-app.wav"},
  {15, "015-mip-awww.wav"},
  {16, "016-mip-big-shot.wav"},
  {17, "017-mip-bleh.wav"},
  {18, "018-mip-boom.wav"},
  {19, "019-mip-bye.wav"},
  {20, "020-mip-converse-1.wav"},
  {21, "021-mip-converse-2.wav"},
  {22, "022-mip-drop.wav"},
  {23, "023-mip-dunno.wav"},
  {24, "024-mip-fall-over-1.wav"},
  {25, "025-mip-fall-over-2.wav"},
  {26, "026-mip-fight.wav"},
  {27, "027-mip-game.wav"},
  {28, "028-mip-gloat.wav"},
  {29, "029-mip-go.wav"},
  {30, "030-mip-gogogo.wav"},
  {31, "031-mip-grunt-1.wav"},
  {32, "032-mip-grunt-2.wav"},
  {33, "033-mip-grunt-3.wav"},
  {34, "034-mip-haha-got-it.wav"},
  {35, "035-mip-hi-confident.wav"},
  {36, "036-mip-hi-not-sure.wav"},
  {37, "037-mip-hi-scared.wav"},
  {38, "038-mip-huh.wav"},
  {39, "039-mip-humming-1.wav"},
  {40, "040-mip-humming-2.wav"},
  {41, "041-mip-hurt.wav"},
  {42, "042-mip-huuurgh.wav"},
  {43, "043-mip-in-love.wav"},
  {44, "044-mip-it.wav"},
  {45, "045-mip-joke.wav"},
  {46, "046-mip-k.wav"},
  {47, "047-mip-loop-1.wav"},
  {48, "048-mip-loop-2.wav"},
  {49, "049-mip-low-battery.wav"},
  {50, "050-mip-mippee.wav"},
  {51, "051-mip-more.wav"},
  {52, "052-mip-muah-ha.wav"},
  {53, "053-mip-music.wav"},
  {54, "054-mip-obstacle.wav"},
  {55, "055-mip-ohoh.wav"},
  {56, "056-mip-oh-yeah.wav"},
  {57, "057-mip-oopsie.wav"},
  {58, "058-mip-ouch-1.wav"},
  {59, "059-mip-ouch-2.wav"},
  {60, "060-mip-play.wav"},
  {61, "061-mip-push.wav"},
  {62, "062-mip-run.wav"},
  {63, "063-mip-shake.wav"},
  {64, "064-mip-sigh.wav"},
  {65, "065-mip-singing.wav"},
  {66, "066-mip-sneeze.wav"},
  {67, "067-mip-snore.wav"},
  {68, "068-mip-stack.wav"},
  {69, "069-mip-swipe-1.wav"},
  {70, "070-mip-swipe-2.wav"},
  {71, "071-mip-tricks.wav"},
  {72, "072-mip-triiick.wav"},
  {73, "073-mip-trumpet.wav"},
  {74, "074-mip-waaaaa.wav"},
  {75, "075-mip-wakey.wav"},
  {76, "076-mip-wheee.wav"},
  {77, "077-mip-whistling.wav"},
  {78, "078-mip-whoah.wav"},
  {79, "079-mip-woo.wav"},
  {80, "080-mip-yeah.wav"},
  {81, "081-mip-yeeesss.wav"},
  {82, "082-mip-yo.wav"},
  {83, "083-mip-yummy.wav"},
  {84, "084-mood-activated.wav"},
  {85, "085-mood-angry.wav"},
  {86, "086-mood-anxious.wav"},
  {87, "087-mood-boring.wav"},
  {88, "088-mood-cranky.wav"},
  {89, "089-mood-energetic.wav"},
  {90, "090-mood-excited.wav"},
  {91, "091-mood-giddy.wav"},
  {92, "092-mood-grumpy.wav"},
  {93, "093-mood-happy.wav"},
  {94, "094-mood-idea.wav"},
  {95, "095-mood-impatient.wav"},
  {96, "096-mood-nice.wav"},
  {97, "097-mood-sad.wav"},
  {98, "098-mood-short.wav"},
  {99, "099-mood-sleepy.wav"},
  {100, "100-mood-tired.wav"},
  {101, "101-sound-boost.wav"},
  {102, "102-sound-cage.wav"},
  {103, "103-sound-guns.wav"},
  {104, "104-sound-zings.wav"},
  {105, "105-short-mute-for-stop.wav"},
  {106, "106-freestyle-tracking-2.wav"},
};

static inline float clampf(float value, float lo, float hi) {
  if (value < lo) return lo;
  if (value > hi) return hi;
  return value;
}

static inline int clampi(int value, int lo, int hi) {
  if (value < lo) return lo;
  if (value > hi) return hi;
  return value;
}

static inline bool debugEnabled() {
  return DEBUG_LOGS != 0;
}

void debugf(const char *fmt, ...) {
  if (!debugEnabled()) return;
  char buffer[192];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buffer, sizeof(buffer), fmt, args);
  va_end(args);
  Serial.println(buffer);
}

uint64_t unixMillis() {
  struct timeval tv;
  if (gettimeofday(&tv, nullptr) == 0 && tv.tv_sec > 1600000000) {
    return (uint64_t)tv.tv_sec * 1000ULL + (uint64_t)(tv.tv_usec / 1000);
  }
  return 0;
}

double unixSecondsDouble() {
  uint64_t ms = unixMillis();
  if (ms == 0) return 0.0;
  return (double)ms / 1000.0;
}

bool ensureTimeSync() {
  if (unixMillis() != 0) {
    timeSynced = true;
    return true;
  }
  configTime(0, 0, "pool.ntp.org", "time.nist.gov", "time.google.com");
  for (int i = 0; i < 24; ++i) {
    delay(250);
    if (unixMillis() != 0) {
      timeSynced = true;
      return true;
    }
  }
  timeSynced = false;
  return false;
}

String topic(const char *direction, const char *metric) {
  return baseTopic + "/" + direction + "/" + metric;
}

bool publishString(const String &topicName, const String &payload, bool retain = false) {
  if (!mqtt.connected()) return false;
  return mqtt.publish(topicName.c_str(), reinterpret_cast<const uint8_t *>(payload.c_str()), payload.length(), retain);
}

template <typename TJsonDocument>
bool publishJsonDocument(const String &topicName, TJsonDocument &doc, bool retain = false) {
  String payload;
  size_t estimated = measureJson(doc) + 1;
  payload.reserve(estimated);
  serializeJson(doc, payload);
  return publishString(topicName, payload, retain);
}

void publishLog(const char *level, const char *message) {
  StaticJsonDocument<384> doc;
  uint64_t t = unixMillis();
  if (t != 0) doc["t"] = t;
  doc["level"] = level;
  doc["service"] = "mip_firmware";
  doc["message"] = message;
  doc["logger"] = "firmware";
  publishJsonDocument(topicLogs, doc, false);
}

void publishLogf(const char *level, const char *fmt, ...) {
  char buffer[192];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buffer, sizeof(buffer), fmt, args);
  va_end(args);
  publishLog(level, buffer);
}

uint8_t mipExpectedFrameLength(uint8_t cmd) {
  switch (cmd) {
    case MIP_CMD_GET_GESTURE_RESPONSE:
    case MIP_CMD_GET_RADAR_RESPONSE:
    case MIP_CMD_GET_GESTURE_RADAR_MODE:
    case MIP_CMD_GET_VOLUME:
    case MIP_CMD_GET_WEIGHT:
    case MIP_CMD_CLAP_RESPONSE:
      return 2;
    case MIP_CMD_GET_STATUS:
    case MIP_CMD_GET_HARDWARE_INFO:
      return 3;
    case MIP_CMD_GET_SOFTWARE_VERSION:
    case MIP_CMD_READ_ODOMETER:
    case MIP_CMD_GET_HEAD_LEDS:
      return 5;
    case MIP_CMD_GET_CHEST_LED:
      return 6;
    case MIP_CMD_SHAKE_RESPONSE:
      return 1;
    default:
      return 0;
  }
}

const char *positionName(uint8_t position) {
  switch (position) {
    case 0x00: return "on_back";
    case 0x01: return "face_down";
    case 0x02: return "upright";
    case 0x03: return "picked_up";
    case 0x04: return "hand_stand";
    case 0x05: return "face_down_on_tray";
    case 0x06: return "on_back_with_kickstand";
    default: return "unknown";
  }
}

