acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
float batteryRawToVolts(uint8_t raw) {
  return (((float)raw - 0x4D) / (float)(0x7C - 0x4D)) * (6.4f - 4.0f) + 4.0f;
}

void cacheMipFrame(const uint8_t *frame, size_t length) {
  if (length == 0) return;
  lastMipResponseMs = millis();
  mipRxOk = true;
  switch (frame[0]) {
    case MIP_CMD_GET_STATUS:
      if (length == 3) {
        mipBatteryVolts = batteryRawToVolts(frame[1]);
        mipPosition = frame[2];
      }
      break;
    case MIP_CMD_READ_ODOMETER:
      if (length == 5) {
        uint32_t ticks = ((uint32_t)frame[1] << 24) | ((uint32_t)frame[2] << 16) | ((uint32_t)frame[3] << 8) | frame[4];
        mipOdometerCm = (float)((double)ticks / 48.5);
      }
      break;
    case MIP_CMD_GET_VOLUME:
      if (length == 2) mipVolume = frame[1];
      break;
    case MIP_CMD_GET_SOFTWARE_VERSION:
      if (length == 5) {
        snprintf(mipSoftwareVersion, sizeof(mipSoftwareVersion), "%u.%u.%u.%u",
                 (unsigned int)(2000 + frame[1]), (unsigned int)frame[2],
                 (unsigned int)frame[3], (unsigned int)frame[4]);
      }
      break;
    case MIP_CMD_GET_HARDWARE_INFO:
      if (length == 3) {
        snprintf(mipHardwareInfo, sizeof(mipHardwareInfo), "voice=%u hardware=%u",
                 (unsigned int)frame[1], (unsigned int)frame[2]);
      }
      break;
    case MIP_CMD_GET_RADAR_RESPONSE:
      if (length == 2) {
        lastRadar = frame[1];
        lastRadarMs = millis();
      }
      break;
    case MIP_CMD_GET_GESTURE_RESPONSE:
      if (length == 2) {
        lastGesture = frame[1];
        lastGestureMs = millis();
      }
      break;
    case MIP_CMD_CLAP_RESPONSE:
      if (length == 2) {
        lastClapCount = frame[1];
        lastClapMs = millis();
      }
      break;
    case MIP_CMD_GET_WEIGHT:
      if (length == 2) {
        lastWeight = (int8_t)frame[1];
        lastWeightMs = millis();
      }
      break;
    case MIP_CMD_SHAKE_RESPONSE:
      lastShake = true;
      lastShakeMs = millis();
      break;
    default:
      break;
  }
}

bool readMipFrame(uint8_t *frame, size_t frameSize, size_t &length, unsigned long timeoutMs) {
  unsigned long deadline = millis() + timeoutMs;
  while ((long)(deadline - millis()) >= 0) {
    if (Serial1.available() <= 0) {
      delay(1);
      continue;
    }
    uint8_t cmd = (uint8_t)Serial1.read();
    uint8_t expected = mipExpectedFrameLength(cmd);
    if (expected == 0 || expected > frameSize) {
      continue;
    }
    frame[0] = cmd;
    size_t offset = 1;
    unsigned long byteDeadline = millis() + 20;
    while (offset < expected && (long)(byteDeadline - millis()) >= 0) {
      if (Serial1.available() > 0) {
        frame[offset++] = (uint8_t)Serial1.read();
        byteDeadline = millis() + 20;
      } else {
        delay(1);
      }
    }
    if (offset == expected) {
      length = expected;
      cacheMipFrame(frame, length);
      return true;
    }
  }
  return false;
}

void processMipIncoming(unsigned long budgetMs) {
  unsigned long deadline = millis() + budgetMs;
  do {
    if (Serial1.available() <= 0) return;
    uint8_t frame[8];
    size_t length = 0;
    if (!readMipFrame(frame, sizeof(frame), length, 1)) return;
  } while ((long)(deadline - millis()) >= 0);
}

bool mipSendRaw(const uint8_t *request, size_t length, bool appendZero) {
  if (length == 0) return false;
  size_t written = Serial1.write(request, length);
  if (appendZero) {
    written += Serial1.write((uint8_t)0x00);
    length += 1;
  }
  Serial1.flush();
  return written == length;
}

bool mipSend(const uint8_t *request, size_t length) {
  return mipSendRaw(request, length, MIP_UART_APPEND_ZERO != 0);
}

void mipSendSparkFunWake() {
#if MIP_UART_SPARKFUN_WAKE
  const uint8_t wake[] = {'T', 'T', 'M', ':', 'O', 'K', '\r', '\n'};
  mipSend(wake, sizeof(wake));
  delay(100);
#endif
}

bool mipRequestResponse(const uint8_t *request, size_t requestLength, uint8_t expectedCmd,
                        uint8_t *response, size_t responseSize, size_t &responseLength,
                        unsigned long timeoutMs) {
  processMipIncoming(2);
  if (!mipSend(request, requestLength)) return false;
  unsigned long deadline = millis() + timeoutMs;
  while ((long)(deadline - millis()) >= 0) {
    uint8_t frame[8];
    size_t length = 0;
    if (!readMipFrame(frame, sizeof(frame), length, 4)) {
      continue;
    }
    if (length > 0 && frame[0] == expectedCmd) {
      if (length <= responseSize) {
        memcpy(response, frame, length);
        responseLength = length;
      }
      return true;
    }
  }
  return false;
}

bool mipQuery(uint8_t cmd, uint8_t *response, size_t responseSize, size_t &responseLength, unsigned long timeoutMs = 80) {
  uint8_t request[1] = {cmd};
  return mipRequestResponse(request, sizeof(request), cmd, response, responseSize, responseLength, timeoutMs);
}

void mipStop() {
  uint8_t command[1] = {MIP_CMD_STOP};
  mipSend(command, sizeof(command));
}

void mipSetGameModeApp() {
  uint8_t command[2] = {MIP_CMD_SET_GAME_MODE, MIP_GAME_MODE_APP};
  mipSend(command, sizeof(command));
}

void mipGetUpEither() {
  uint8_t command[2] = {MIP_CMD_GET_UP, MIP_GET_UP_FROM_EITHER};
  if (mipSend(command, sizeof(command))) {
    lastGetUpMs = millis();
    ++getUpCommandCount;
  }
}

uint8_t encodeVelocity(int8_t velocity) {
  velocity = (int8_t)clampi(velocity, -32, 32);
  if (velocity == 0) return 0x00;
  if (velocity < 0) return (uint8_t)(0x20 + (-velocity));
  return (uint8_t)velocity;
}

uint8_t encodeTurnRate(int8_t turnRate) {
  turnRate = (int8_t)clampi(turnRate, -32, 32);
  if (turnRate == 0) return 0x00;
  if (turnRate < 0) return (uint8_t)(0x60 + (-turnRate));
  return (uint8_t)(0x40 + turnRate);
}

void mipContinuousDrive(int8_t velocity, int8_t turnRate) {
  uint8_t command[3] = {
    MIP_CMD_CONTINUOUS_DRIVE,
    encodeVelocity(velocity),
    encodeTurnRate(turnRate),
  };
  mipSend(command, sizeof(command));
}

void mipSetChestLed(uint8_t red, uint8_t green, uint8_t blue) {
  uint8_t command[4] = {MIP_CMD_SET_CHEST_LED, red, green, blue};
  mipSend(command, sizeof(command));
}

void mipFlashChestLed(uint8_t red, uint8_t green, uint8_t blue, uint16_t onMs, uint16_t offMs) {
  uint8_t command[6] = {
    MIP_CMD_FLASH_CHEST_LED,
    red,
    green,
    blue,
    (uint8_t)clampi((int)(onMs / 20), 1, 255),
    (uint8_t)clampi((int)(offMs / 20), 1, 255),
  };
  mipSend(command, sizeof(command));
}

void mipPlaySound(uint8_t soundIndex, uint8_t repeatCount = 0) {
  mipSetGameModeApp();
  uint8_t command[18];
  command[0] = MIP_CMD_PLAY_SOUND;
  command[1] = MIP_SOUND_VOLUME_7;
  command[2] = 0x00;
  command[3] = soundIndex;
  command[4] = 0x00;
  for (uint8_t i = 2; i < 8; ++i) {
    command[1 + i * 2] = MIP_SOUND_SHORT_MUTE_FOR_STOP;
    command[1 + i * 2 + 1] = 0x00;
  }
  command[17] = repeatCount;
  mipSend(command, sizeof(command));
}

void mipSetVolume(uint8_t volume) {
  uint8_t command[2] = {MIP_CMD_SET_VOLUME, (uint8_t)clampi(volume, 0, 7)};
  mipSend(command, sizeof(command));
}

bool queryMipStatus(unsigned long timeoutMs = 80) {
  uint8_t response[8];
  size_t length = 0;
  return mipQuery(MIP_CMD_GET_STATUS, response, sizeof(response), length, timeoutMs) && length == 3;
}

