acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
bool queryMipOdometer(unsigned long timeoutMs = 80) {
  uint8_t response[8];
  size_t length = 0;
  return mipQuery(MIP_CMD_READ_ODOMETER, response, sizeof(response), length, timeoutMs) && length == 5;
}

void queryMipStartupInfo() {
  uint8_t response[8];
  size_t length = 0;
  mipSetVolume(MIP_SOUND_DEFAULT_VOLUME);
  mipQuery(MIP_CMD_GET_SOFTWARE_VERSION, response, sizeof(response), length, 120);
  mipQuery(MIP_CMD_GET_HARDWARE_INFO, response, sizeof(response), length, 120);
  mipQuery(MIP_CMD_GET_VOLUME, response, sizeof(response), length, 120);
}

bool beginMipUartAt(uint32_t baud, bool probe) {
  Serial1.end();
  Serial1.begin(baud, SERIAL_8N1, mipRxPin, mipTxPin);
  delay(80);
  while (Serial1.available() > 0) Serial1.read();
  mipBaud = baud;
  mipSendSparkFunWake();
  mipSetGameModeApp();
  mipStop();
  if (!probe) return true;
  return queryMipStatus(120);
}

void beginMipUart() {
  mipRxOk = false;
  mipTxPin = MIP_UART_TX_PIN;
  mipRxPin = MIP_UART_RX_PIN;
  bool gotResponse = beginMipUartAt(MIP_UART_BAUD, true);
#if MIP_UART_PROBE_ALTERNATE_BAUD
  if (!gotResponse && MIP_UART_ALTERNATE_BAUD != MIP_UART_BAUD) {
    gotResponse = beginMipUartAt(MIP_UART_ALTERNATE_BAUD, true);
    if (!gotResponse) {
#if MIP_UART_TX_ONLY_FALLBACK_ALTERNATE
      beginMipUartAt(MIP_UART_ALTERNATE_BAUD, false);
#else
      beginMipUartAt(MIP_UART_BAUD, false);
#endif
    }
  }
#endif
  if (gotResponse) {
    queryMipStartupInfo();
    publishLogf("INFO", "MiP UART RX OK at %lu baud", (unsigned long)mipBaud);
    debugf("MiP UART RX OK at %lu", (unsigned long)mipBaud);
  } else {
    publishLogf("WARNING", "MiP UART no response; TX-only mode at %lu baud", (unsigned long)mipBaud);
    debugf("MiP UART TX-only/no response at %lu", (unsigned long)mipBaud);
  }
}

int hexValue(char c) {
  if (c >= '0' && c <= '9') return c - '0';
  if (c >= 'a' && c <= 'f') return 10 + (c - 'a');
  if (c >= 'A' && c <= 'F') return 10 + (c - 'A');
  return -1;
}

bool parseHexBytes(const char *hex, uint8_t *out, size_t outSize, size_t &outLen) {
  outLen = 0;
  int highNibble = -1;
  for (const char *p = hex; p != nullptr && *p != '\0'; ++p) {
    if (isspace((unsigned char)*p) || *p == ':' || *p == '-' || *p == ',') continue;
    if (highNibble < 0 && *p == '0' && (p[1] == 'x' || p[1] == 'X')) {
      ++p;
      continue;
    }
    int v = hexValue(*p);
    if (v < 0) return false;
    if (highNibble < 0) {
      highNibble = v;
      continue;
    }
    if (outLen >= outSize) return false;
    out[outLen++] = (uint8_t)((highNibble << 4) | v);
    highNibble = -1;
  }
  return highNibble < 0 && outLen > 0;
}

bool jsonBoolValue(JsonVariant value, bool &out) {
  if (value.is<bool>()) {
    out = value.as<bool>();
    return true;
  }
  if (value.is<int>()) {
    out = value.as<int>() != 0;
    return true;
  }
  if (value.is<JsonObject>()) {
    JsonObject obj = value.as<JsonObject>();
    if (obj["value"].is<bool>() || obj["value"].is<int>()) {
      out = obj["value"].as<bool>();
      return true;
    }
    if (obj["enabled"].is<bool>() || obj["enabled"].is<int>()) {
      out = obj["enabled"].as<bool>();
      return true;
    }
  }
  return false;
}

JsonVariant unwrapValue(JsonVariant value) {
  if (value.is<JsonObject>()) {
    JsonObject obj = value.as<JsonObject>();
    if (obj["value"].is<JsonObject>()) {
      return obj["value"].as<JsonVariant>();
    }
  }
  return value;
}

uint8_t colorByte(JsonVariant value) {
  float raw = value | 0.0f;
  return (uint8_t)clampi((int)lroundf(clampf(raw, 0.0f, 1.0f) * 255.0f), 0, 255);
}

void handleDrivePayload(JsonVariant payload) {
  JsonVariant v = unwrapValue(payload);
  float x = clampf(v["x"] | 0.0f, -1.0f, 1.0f);
  float z = clampf(v["z"] | 0.0f, -1.0f, 1.0f);
  int turnSign = MIP_TURN_INVERT ? -1 : 1;
  targetVelocity = (int8_t)clampi((int)lroundf(z * 32.0f), -32, 32);
  targetTurnRate = (int8_t)clampi((int)lroundf(x * 32.0f * turnSign), -32, 32);
  ++driveCommandCount;
  lastDriveCommandMs = millis();
  driveActive = true;
  driveStoppedForTimeout = false;
  if ((targetVelocity != 0 || targetTurnRate != 0) &&
      mipPosition != 0x02 &&
      (lastGetUpMs == 0 || (millis() - lastGetUpMs) > 5000UL)) {
    mipGetUpEither();
  }
  mipContinuousDrive(targetVelocity, targetTurnRate);
  lastDriveRefreshMs = millis();
}

void handleLightsSolidPayload(JsonVariant payload) {
  JsonVariant v = unwrapValue(payload);
  uint8_t blue = colorByte(v["b"]);
  uint8_t green = colorByte(v["g"]);
  uint8_t red = colorByte(v["r"]);
  ++lightsCommandCount;
  mipSetChestLed(red, green, blue);
  publishLogf("INFO", "lights solid r=%u g=%u b=%u", (unsigned int)red, (unsigned int)green, (unsigned int)blue);
}

void handleLightsFlashPayload(JsonVariant payload) {
  JsonVariant v = unwrapValue(payload);
  uint8_t blue = colorByte(v["b"]);
  uint8_t green = colorByte(v["g"]);
  uint8_t red = colorByte(v["r"]);
  float periodSeconds = clampf(v["period"] | 2.0f, 0.05f, 30.0f);
  uint16_t halfPeriodMs = (uint16_t)clampi((int)lroundf(periodSeconds * 500.0f), 20, 5100);
  ++lightsCommandCount;
  mipFlashChestLed(red, green, blue, halfPeriodMs, halfPeriodMs);
  publishLogf("INFO", "lights flash r=%u g=%u b=%u period_ms=%u",
              (unsigned int)red, (unsigned int)green, (unsigned int)blue,
              (unsigned int)(halfPeriodMs * 2));
}

bool equalIgnoreCase(const char *lhs, const char *rhs) {
  if (lhs == nullptr || rhs == nullptr) return false;
  while (*lhs && *rhs) {
    if (tolower((unsigned char)*lhs) != tolower((unsigned char)*rhs)) return false;
    ++lhs;
    ++rhs;
  }
  return *lhs == '\0' && *rhs == '\0';
}

int parseSoundIndex(const char *fileName) {
  if (fileName == nullptr) return -1;
  for (size_t i = 0; i < sizeof(MIP_SOUNDS) / sizeof(MIP_SOUNDS[0]); ++i) {
    if (equalIgnoreCase(fileName, MIP_SOUNDS[i].name)) {
      return MIP_SOUNDS[i].index;
    }
  }
  int value = -1;
  for (const char *p = fileName; *p != '\0'; ++p) {
    if (!isdigit((unsigned char)*p)) continue;
    value = 0;
    while (isdigit((unsigned char)*p)) {
      value = value * 10 + (*p - '0');
      ++p;
    }
    break;
  }
  if (value >= 1 && value <= MIP_SOUND_MAX_BUILTIN) return value;
  return -1;
}

const char *soundNameForIndex(uint8_t index) {
  for (size_t i = 0; i < sizeof(MIP_SOUNDS) / sizeof(MIP_SOUNDS[0]); ++i) {
    if (MIP_SOUNDS[i].index == index) return MIP_SOUNDS[i].name;
  }
  return "";
}

