acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
void publishSoundboardStatus();
bool initCamera();

void handleSoundboardPayload(JsonVariant payload) {
  JsonVariant v = unwrapValue(payload);
  bool stopRequested = false;
  const char *action = nullptr;
  const char *file = nullptr;
  if (v.is<bool>()) {
    stopRequested = !v.as<bool>();
  } else if (v.is<JsonObject>()) {
    action = v["action"] | "";
    file = v["file"] | "";
    if (action && (equalIgnoreCase(action, "stop") || equalIgnoreCase(action, "stopped"))) {
      stopRequested = true;
    }
    if ((file == nullptr || file[0] == '\0') && v["enabled"].is<bool>() && !v["enabled"].as<bool>()) {
      stopRequested = true;
    }
  }

  if (stopRequested) {
    mipPlaySound(MIP_SOUND_SHORT_MUTE_FOR_STOP, 0);
    soundPlaying = false;
    currentSoundIndex = 0;
    currentSoundFile[0] = '\0';
    publishLog("INFO", "soundboard stop");
    publishSoundboardStatus();
    return;
  }

  int soundIndex = parseSoundIndex(file);
  if (soundIndex < 1) {
    publishLog("WARNING", "soundboard command missing known MiP sound file");
    return;
  }
  mipSetVolume(MIP_SOUND_DEFAULT_VOLUME);
  mipPlaySound((uint8_t)soundIndex, 0);
  soundPlaying = true;
  currentSoundIndex = (uint8_t)soundIndex;
  snprintf(currentSoundFile, sizeof(currentSoundFile), "%s", soundNameForIndex(currentSoundIndex));
  publishLogf("INFO", "soundboard play index=%u file=%s",
              (unsigned int)currentSoundIndex, currentSoundFile);
  publishSoundboardStatus();
}

void handleMipRawPayload(JsonVariant payload) {
  JsonVariant v = unwrapValue(payload);
  uint8_t bytes[32];
  size_t byteCount = 0;
  bool appendZero = MIP_UART_APPEND_ZERO != 0;
  uint8_t requestedTxPin = mipTxPin;
  uint8_t requestedRxPin = mipRxPin;
  uint32_t requestedBaud = mipBaud;
  bool reconfigureUart = false;

  if (v.is<const char *>()) {
    if (!parseHexBytes(v.as<const char *>(), bytes, sizeof(bytes), byteCount)) {
      publishLog("WARNING", "mip raw command invalid hex string");
      return;
    }
  } else if (v.is<JsonObject>()) {
    JsonObject obj = v.as<JsonObject>();
    if (obj["append_zero"].is<bool>()) appendZero = obj["append_zero"].as<bool>();
    if (obj["terminator"].is<bool>()) appendZero = obj["terminator"].as<bool>();
    if (obj["swap_d6_d7"].is<bool>() && obj["swap_d6_d7"].as<bool>()) {
      requestedTxPin = MIP_UART_RX_PIN;
      requestedRxPin = MIP_UART_TX_PIN;
      reconfigureUart = true;
    }
    if (obj["tx_pin"].is<int>()) {
      int tx = obj["tx_pin"].as<int>();
      if (tx < 0 || tx > 48) {
        publishLog("WARNING", "mip raw command tx_pin outside valid range");
        return;
      }
      requestedTxPin = (uint8_t)tx;
      reconfigureUart = true;
    }
    if (obj["rx_pin"].is<int>()) {
      int rx = obj["rx_pin"].as<int>();
      if (rx < 0 || rx > 48) {
        publishLog("WARNING", "mip raw command rx_pin outside valid range");
        return;
      }
      requestedRxPin = (uint8_t)rx;
      reconfigureUart = true;
    }
    if (obj["baud"].is<int>()) {
      int baud = obj["baud"].as<int>();
      if (baud < 1200 || baud > 1000000) {
        publishLog("WARNING", "mip raw command baud outside valid range");
        return;
      }
      requestedBaud = (uint32_t)baud;
      reconfigureUart = true;
    }

    if (obj["hex"].is<const char *>()) {
      if (!parseHexBytes(obj["hex"].as<const char *>(), bytes, sizeof(bytes), byteCount)) {
        publishLog("WARNING", "mip raw command invalid hex field");
        return;
      }
    } else if (obj["bytes"].is<JsonArray>()) {
      JsonArray arr = obj["bytes"].as<JsonArray>();
      if (arr.size() == 0 || arr.size() > sizeof(bytes)) {
        publishLog("WARNING", "mip raw command invalid byte count");
        return;
      }
      for (JsonVariant item : arr) {
        if (!item.is<int>()) {
          publishLog("WARNING", "mip raw command contains non-integer byte");
          return;
        }
        int value = item.as<int>();
        if (value < 0 || value > 255) {
          publishLog("WARNING", "mip raw command byte outside 0..255");
          return;
        }
        bytes[byteCount++] = (uint8_t)value;
      }
    }
  }

  if (byteCount == 0) {
    publishLog("WARNING", "mip raw command missing bytes");
    return;
  }

  if (reconfigureUart) {
    Serial1.end();
    mipTxPin = requestedTxPin;
    mipRxPin = requestedRxPin;
    mipBaud = requestedBaud;
    mipRxOk = false;
    Serial1.begin(mipBaud, SERIAL_8N1, mipRxPin, mipTxPin);
    delay(80);
    while (Serial1.available() > 0) Serial1.read();
    mipSendSparkFunWake();
    mipSetGameModeApp();
    publishLogf("INFO", "MiP UART reconfigured tx=%u rx=%u baud=%lu",
                (unsigned int)mipTxPin, (unsigned int)mipRxPin, (unsigned long)mipBaud);
  }

  if (!mipSendRaw(bytes, byteCount, appendZero)) {
    publishLog("WARNING", "mip raw command UART write failed");
    return;
  }
  publishLogf("INFO", "mip raw command sent bytes=%u append_zero=%s",
              (unsigned int)byteCount, appendZero ? "true" : "false");
}

void handleVideoControlPayload(JsonVariant payload) {
  bool enabled = false;
  if (!jsonBoolValue(payload, enabled)) return;
  if (!MIP_CAMERA_ENABLED) {
    videoEnabled = false;
    cameraReady = false;
    publishLog("WARNING", "video command ignored because camera support is disabled");
    return;
  }
  if (!enabled) {
    videoEnabled = false;
#if MIP_CAMERA_ENABLED
    if (cameraReady) {
      esp_camera_deinit();
      cameraReady = false;
    }
#endif
    publishLog("INFO", "video disabled");
    return;
  }
  if (!mqttLargeBufferReady) {
    videoEnabled = false;
    publishLog("WARNING", "video requested but MQTT buffer is not ready");
    return;
  }
  if (!cameraReady) {
    cameraReady = initCamera();
  }
  videoEnabled = cameraReady;
  if (!cameraReady) {
    publishLog("WARNING", "video requested but camera init failed");
  } else {
    publishLog("INFO", "video enabled");
  }
}

void handleRebootPayload(JsonVariant payload) {
  bool requested = false;
  if (!jsonBoolValue(payload, requested) || !requested) return;
#if ALLOW_REMOTE_REBOOT
  publishLog("WARNING", "remote reboot requested");
  mipStop();
  delay(250);
  ESP.restart();
#else
  publishLog("WARNING", "remote reboot ignored by firmware config");
#endif
}

void onMqttMessage(char *rawTopic, byte *payload, unsigned int length) {
  ++mqttMessageCount;
  StaticJsonDocument<1024> doc;
  DeserializationError err = deserializeJson(doc, payload, length);
  if (err) {
    publishLog("WARNING", "incoming MQTT JSON parse failed");
    return;
  }
  JsonVariant root = doc.as<JsonVariant>();
  String incomingTopic(rawTopic);
  if (incomingTopic == topicDrive) {
    handleDrivePayload(root);
  } else if (incomingTopic == topicLightsSolid) {
    handleLightsSolidPayload(root);
  } else if (incomingTopic == topicLightsFlash) {
    handleLightsFlashPayload(root);
  } else if (incomingTopic == topicVideoControl || incomingTopic == topicVideoFlag) {
    handleVideoControlPayload(root);
  } else if (incomingTopic == topicRebootFlag) {
    handleRebootPayload(root);
  } else if (incomingTopic == topicSoundboardCommand) {
    handleSoundboardPayload(root);
  } else if (incomingTopic == topicMipRawCommand) {
    handleMipRawPayload(root);
  }
}

void publishHeartbeat() {
  StaticJsonDocument<128> doc;
  uint64_t t = unixMillis();
  if (t == 0) {
    ensureTimeSync();
    t = unixMillis();
  }
  doc["t"] = t;
  doc["online"] = true;
  doc["status"] = "online";
  publishJsonDocument(topicHeartbeat, doc, true);
}

void publishCapabilities() {
  StaticJsonDocument<6144> doc;
  uint64_t t = unixMillis();
  doc["schema"] = CAPABILITIES_SCHEMA;
  if (t != 0) doc["t"] = t;
  JsonObject value = doc.createNestedObject("value");
  JsonObject identity = value.createNestedObject("identity");
  identity["system"] = SYSTEM_NAME;
  identity["type"] = "robots";
  identity["id"] = ROBOT_ID;
  identity["name"] = ROBOT_NAME;
  identity["model"] = "wowwee_mip_xiao_esp32s3_sense";

  JsonObject video = value.createNestedObject("video");
  video["available"] = MIP_CAMERA_ENABLED && mqttLargeBufferReady;
  video["controls"] = MIP_CAMERA_ENABLED;
  video["topic"] = topicVideo;
  video["command_topic"] = topicVideoControl;
  video["flag_topic"] = topicVideoFlag;
  video["overlays_topic"] = topicVideoOverlays;
  video["encoding"] = "jpeg";
  video["transport"] = "binary_mqtt";
  video["width"] = 160;
  video["height"] = 120;
  video["fps"] = 1;

  JsonObject audio = value.createNestedObject("audio");
  audio["available"] = false;
  audio["controls"] = false;

  JsonObject soundboard = value.createNestedObject("soundboard");
  soundboard["available"] = true;
  soundboard["controls"] = true;
  soundboard["command_topic"] = topicSoundboardCommand;
  soundboard["files_topic"] = topicSoundboardFiles;
  soundboard["status_topic"] = topicSoundboardStatus;
  soundboard["raw_mip_command_topic"] = topicMipRawCommand;

