acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
  JsonObject autonomy = value.createNestedObject("autonomy");
  autonomy["available"] = false;
  autonomy["controls"] = false;
  autonomy["command_topic"] = topicAutonomyCommand;

  JsonObject system = value.createNestedObject("system");
  JsonObject reboot = system.createNestedObject("reboot");
  reboot["available"] = true;
  reboot["controls"] = ALLOW_REMOTE_REBOOT ? true : false;
  reboot["flag_topic"] = topicRebootFlag;
  JsonObject serviceRestart = system.createNestedObject("service_restart");
  serviceRestart["available"] = false;
  serviceRestart["controls"] = false;
  JsonObject gitPull = system.createNestedObject("git_pull");
  gitPull["available"] = false;
  gitPull["controls"] = false;

  JsonObject drive = value.createNestedObject("drive");
  drive["available"] = true;
  drive["controls"] = true;
  drive["topic"] = topicDrive;
  drive["command_topic"] = topicDrive;

  JsonObject lights = value.createNestedObject("lights");
  lights["available"] = true;
  lights["controls"] = true;
  lights["solid"] = true;
  lights["flash"] = true;
  lights["solid_topic"] = topicLightsSolid;
  lights["flash_topic"] = topicLightsFlash;

  JsonObject telemetry = value.createNestedObject("telemetry");
  telemetry["touch_sensors"] = false;
  telemetry["charging_status"] = true;
  telemetry["charging_topic"] = topicChargingStatus;
  telemetry["charging_level_topic"] = topicChargingLevel;
  telemetry["wheel_odometry"] = true;
  telemetry["wheel_odometry_topic"] = topicWheelOdometry;

  publishJsonDocument(topicCapabilities, doc, true);
}

void publishChargingStatus() {
  StaticJsonDocument<128> doc;
  doc["value"] = false;
  doc["source"] = "mip_firmware";
  publishJsonDocument(topicChargingStatus, doc, true);
}

void publishChargingLevel() {
  if (!isfinite(mipBatteryVolts)) return;
  StaticJsonDocument<160> doc;
  doc["value"] = mipBatteryVolts;
  doc["unit"] = "v";
  double ts = unixSecondsDouble();
  if (ts > 0.0) doc["timestamp"] = ts;
  publishJsonDocument(topicChargingLevel, doc, false);
}

void publishStatus() {
  StaticJsonDocument<1024> doc;
  uint64_t t = unixMillis();
  if (t != 0) doc["t"] = t;
  JsonObject value = doc.createNestedObject("value");
  value["firmware_version"] = FIRMWARE_VERSION;
  value["video_enabled"] = videoEnabled;
  value["camera_ready"] = cameraReady;
  value["mqtt_large_buffer_ready"] = mqttLargeBufferReady;
  value["mip_baud"] = mipBaud;
  value["mip_tx_pin"] = mipTxPin;
  value["mip_rx_pin"] = mipRxPin;
  value["mip_rx_ok"] = mipRxOk;
  value["mqtt_message_count"] = mqttMessageCount;
  value["drive_command_count"] = driveCommandCount;
  value["lights_command_count"] = lightsCommandCount;
  value["get_up_command_count"] = getUpCommandCount;
  value["target_velocity"] = targetVelocity;
  value["target_turn_rate"] = targetTurnRate;
  if (isfinite(mipBatteryVolts)) value["battery_v"] = mipBatteryVolts;
  if (mipPosition != 0xFF) {
    value["position_code"] = mipPosition;
    value["position"] = positionName(mipPosition);
  }
  if (mipSoftwareVersion[0]) value["mip_software_version"] = mipSoftwareVersion;
  if (mipHardwareInfo[0]) value["mip_hardware_info"] = mipHardwareInfo;
  if (mipVolume != 0xFF) value["volume"] = mipVolume;
  if (lastRadarMs > 0) value["last_radar"] = lastRadar;
  if (lastGestureMs > 0) value["last_gesture"] = lastGesture;
  if (lastClapMs > 0) value["last_clap_count"] = lastClapCount;
  if (lastWeightMs > 0) value["last_weight"] = lastWeight;
  if (lastShakeMs > 0) value["last_shake"] = lastShake;
  publishJsonDocument(topicStatus, doc, true);
}

void updateOdometryFromMip() {
  if (!isfinite(mipOdometerCm)) return;
  if (!isfinite(odomReferenceCm)) {
    odomReferenceCm = mipOdometerCm;
    odomLastCm = mipOdometerCm;
    odomLastIntegrateMs = millis();
    return;
  }
  float deltaCm = mipOdometerCm - odomLastCm;
  if (deltaCm < -1.0f) {
    odomReferenceCm = mipOdometerCm;
    odomLastCm = mipOdometerCm;
    return;
  }
  deltaCm = fmaxf(0.0f, deltaCm);
  unsigned long now = millis();
  float dt = odomLastIntegrateMs == 0 ? 0.0f : (float)(now - odomLastIntegrateMs) / 1000.0f;
  odomLastIntegrateMs = now;
  float signedDeltaMm = deltaCm * 10.0f;
  if (targetVelocity < 0) signedDeltaMm = -signedDeltaMm;
  odomHeadingRad += ((float)targetTurnRate / 32.0f) * MIP_ODOM_MAX_TURN_RADPS * dt;
  odomXmm += signedDeltaMm * cosf(odomHeadingRad);
  odomYmm += signedDeltaMm * sinf(odomHeadingRad);
  odomLastCm = mipOdometerCm;
}

void publishWheelOdometry() {
  StaticJsonDocument<512> doc;
  JsonObject value = doc.createNestedObject("value");
  float totalMm = isfinite(mipOdometerCm) && isfinite(odomReferenceCm) ? (mipOdometerCm - odomReferenceCm) * 10.0f : 0.0f;
  value["x_mm"] = odomXmm;
  value["y_mm"] = odomYmm;
  value["heading_rad"] = odomHeadingRad;
  value["heading_deg"] = odomHeadingRad * 180.0f / PI;
  value["distance_mm"] = totalMm;
  value["sample_seq"] = odomPublishSeq;
  value["publish_seq"] = odomPublishSeq++;
  doc["unit"] = "mm";
  doc["source"] = "mip-odometer-command-integrator";
  double ts = unixSecondsDouble();
  if (ts > 0.0) doc["timestamp"] = ts;
  publishJsonDocument(topicWheelOdometry, doc, false);
}

void publishSoundboardFiles() {
  String payload;
  payload.reserve(4096);
  payload += "{\"files\":[";
  for (size_t i = 0; i < sizeof(MIP_SOUNDS) / sizeof(MIP_SOUNDS[0]); ++i) {
    if (i > 0) payload += ",";
    payload += "\"";
    payload += MIP_SOUNDS[i].name;
    payload += "\"";
  }
  payload += "],\"controls\":true";
  double ts = unixSecondsDouble();
  if (ts > 0.0) {
    payload += ",\"timestamp\":";
    payload += String(ts, 3);
  }
  payload += "}";
  publishString(topicSoundboardFiles, payload, true);
}

void publishSoundboardStatus() {
  StaticJsonDocument<256> doc;
  doc["playing"] = soundPlaying;
  if (currentSoundFile[0]) doc["file"] = currentSoundFile;
  doc["sound_index"] = currentSoundIndex;
  doc["controls"] = true;
  double ts = unixSecondsDouble();
  if (ts > 0.0) doc["timestamp"] = ts;
  publishJsonDocument(topicSoundboardStatus, doc, true);
}

