acmattson3/pebble/firmware/MIP_seeed-xiao-esp32s3-sense/MIP_seeed-xiao-esp32s3-sense.ino
uint32_t adler32(const uint8_t *data, size_t length) {
  const uint32_t MOD_ADLER = 65521;
  uint32_t a = 1;
  uint32_t b = 0;
  for (size_t i = 0; i < length; ++i) {
    a = (a + data[i]) % MOD_ADLER;
    b = (b + a) % MOD_ADLER;
  }
  return (b << 16) | a;
}

bool zlibStoredWrap(const uint8_t *input, size_t inputLength, uint8_t *&output, size_t &outputLength) {
  size_t blockCount = (inputLength + 65534UL) / 65535UL;
  if (blockCount == 0) blockCount = 1;
  outputLength = 2 + inputLength + blockCount * 5 + 4;
  output = (uint8_t *)malloc(outputLength);
  if (!output) return false;
  size_t out = 0;
  output[out++] = 0x78;
  output[out++] = 0x01;
  size_t offset = 0;
  while (offset < inputLength || (inputLength == 0 && offset == 0)) {
    size_t remaining = inputLength - offset;
    uint16_t blockLen = (uint16_t)min((size_t)65535, remaining);
    bool finalBlock = (offset + blockLen) >= inputLength;
    output[out++] = finalBlock ? 0x01 : 0x00;
    output[out++] = (uint8_t)(blockLen & 0xFF);
    output[out++] = (uint8_t)(blockLen >> 8);
    uint16_t nlen = ~blockLen;
    output[out++] = (uint8_t)(nlen & 0xFF);
    output[out++] = (uint8_t)(nlen >> 8);
    if (blockLen > 0) {
      memcpy(output + out, input + offset, blockLen);
      out += blockLen;
      offset += blockLen;
    } else {
      break;
    }
  }
  uint32_t checksum = adler32(input, inputLength);
  output[out++] = (uint8_t)(checksum >> 24);
  output[out++] = (uint8_t)(checksum >> 16);
  output[out++] = (uint8_t)(checksum >> 8);
  output[out++] = (uint8_t)checksum;
  outputLength = out;
  return true;
}

bool base64Encode(const uint8_t *input, size_t inputLength, char *&output, size_t &outputLength) {
  size_t outSize = ((inputLength + 2) / 3) * 4 + 1;
  output = (char *)malloc(outSize);
  if (!output) return false;
  size_t encodedLength = 0;
  int rc = mbedtls_base64_encode((unsigned char *)output, outSize, &encodedLength, input, inputLength);
  if (rc != 0) {
    free(output);
    output = nullptr;
    outputLength = 0;
    return false;
  }
  output[encodedLength] = '\0';
  outputLength = encodedLength;
  return true;
}

bool initCamera() {
  if (!MIP_CAMERA_ENABLED) return false;
  camera_config_t config;
  memset(&config, 0, sizeof(config));
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
#else
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
#endif
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = CAMERA_FRAME_SIZE;
  config.jpeg_quality = CAMERA_JPEG_QUALITY;
  config.fb_count = psramFound() ? 2 : 1;
  config.fb_location = psramFound() ? CAMERA_FB_IN_PSRAM : CAMERA_FB_IN_DRAM;
  config.grab_mode = CAMERA_GRAB_LATEST;

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    debugf("camera init failed: 0x%08x", (unsigned int)err);
    return false;
  }
  sensor_t *sensor = esp_camera_sensor_get();
  if (sensor) {
    sensor->set_vflip(sensor, MIP_CAMERA_VFLIP ? 1 : 0);
  }
  return true;
}

void publishVideoFrame() {
  if (!MIP_CAMERA_ENABLED) return;
  if (!videoEnabled || !cameraReady || !mqttLargeBufferReady || !mqtt.connected()) return;
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    publishLog("WARNING", "camera frame capture failed");
    return;
  }

  size_t payloadLength = fb->len;
  if (payloadLength + topicVideo.length() + 16 >= MQTT_PACKET_BUFFER_SIZE) {
    publishLogf("WARNING", "video frame exceeds MQTT packet buffer jpeg_bytes=%u",
                (unsigned int)payloadLength);
    esp_camera_fb_return(fb);
    return;
  }
  bool ok = mqtt.publish(topicVideo.c_str(), fb->buf, fb->len, false);
  esp_camera_fb_return(fb);
  if (!ok) {
    publishLog("WARNING", "video frame exceeds MQTT packet buffer");
  }
}

void connectWifi() {
  if (WiFi.status() == WL_CONNECTED) return;
  mipStop();
  publishLog("WARNING", "WiFi disconnected; reconnecting");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  while (WiFi.status() != WL_CONNECTED) {
    delay(250);
  }
  publishLogf("INFO", "WiFi connected ip=%s", WiFi.localIP().toString().c_str());
}

void configureMqttTls() {
#if MQTT_USE_TLS
  if (MQTT_TLS_INSECURE) {
    wifiClient.setInsecure();
  } else {
    wifiClient.setCACert(MQTT_CA_CERT);
  }
#endif
}

void publishStartupState() {
  publishCapabilities();
  publishHeartbeat();
  publishChargingStatus();
  publishStatus();
  publishSoundboardFiles();
  publishSoundboardStatus();
  publishLog("INFO", "MiP firmware connected to MQTT");
}

void subscribeTopics() {
  mqtt.subscribe(topicDrive.c_str(), 0);
  mqtt.subscribe(topicLightsSolid.c_str(), 1);
  mqtt.subscribe(topicLightsFlash.c_str(), 1);
  mqtt.subscribe(topicVideoControl.c_str(), 1);
  mqtt.subscribe(topicVideoFlag.c_str(), 1);
  mqtt.subscribe(topicRebootFlag.c_str(), 1);
  mqtt.subscribe(topicSoundboardCommand.c_str(), 1);
  mqtt.subscribe(topicMipRawCommand.c_str(), 0);
  mqtt.subscribe(topicAutonomyCommand.c_str(), 1);
}

void connectMqtt() {
  while (!mqtt.connected()) {
    mipStop();
    uint64_t chipId = ESP.getEfuseMac();
    String clientId = String("mip-xiao-s3-") + String((uint32_t)(chipId & 0xFFFFFFFF), HEX);
    bool connected = false;
    if (strlen(MQTT_USER) > 0) {
      connected = mqtt.connect(
          clientId.c_str(), MQTT_USER, MQTT_PASS, topicHeartbeat.c_str(), 1, true, MQTT_OFFLINE_PAYLOAD);
    } else {
      connected = mqtt.connect(clientId.c_str(), topicHeartbeat.c_str(), 1, true, MQTT_OFFLINE_PAYLOAD);
    }
    if (connected) {
      subscribeTopics();
      publishStartupState();
    } else {
      publishLogf("WARNING", "MQTT connect failed state=%d", mqtt.state());
      delay(1000);
    }
  }
}

void setupTopics() {
  baseTopic = String(SYSTEM_NAME) + "/robots/" + ROBOT_ID;
  topicDrive = topic("incoming", "drive-values");
  topicLightsSolid = topic("incoming", "lights-solid");
  topicLightsFlash = topic("incoming", "lights-flash");
  topicVideoControl = topic("incoming", "front-camera");
  topicVideoFlag = topic("incoming", "flags/mqtt-video");
  topicRebootFlag = topic("incoming", "flags/reboot");
  topicSoundboardCommand = topic("incoming", "soundboard-command");
  topicMipRawCommand = topic("incoming", "mip-raw");
  topicAutonomyCommand = topic("incoming", "autonomy-command");
  topicHeartbeat = topic("outgoing", "online");
  topicCapabilities = topic("outgoing", "capabilities");
  topicLogs = topic("outgoing", "logs");
  topicStatus = topic("outgoing", "status");
  topicChargingLevel = topic("outgoing", "charging-level");
  topicChargingStatus = topic("outgoing", "charging-status");
  topicWheelOdometry = topic("outgoing", "wheel-odometry");
  topicSoundboardFiles = topic("outgoing", "soundboard-files");
  topicSoundboardStatus = topic("outgoing", "soundboard-status");
  topicVideo = topic("outgoing", "front-camera");
  topicVideoOverlays = topic("outgoing", "video-overlays");
}

void driveSafetyTick() {
  unsigned long now = millis();
  if (driveActive && (now - lastDriveCommandMs) > DRIVE_TIMEOUT_MS) {
    if (!driveStoppedForTimeout) {
      mipStop();
      targetVelocity = 0;
      targetTurnRate = 0;
      driveStoppedForTimeout = true;
    }
    return;
  }
  if (driveActive && !driveStoppedForTimeout && (now - lastDriveRefreshMs) >= DRIVE_REFRESH_MS) {
    lastDriveRefreshMs = now;
    mipContinuousDrive(targetVelocity, targetTurnRate);
  }
}

void telemetryTick() {
  unsigned long now = millis();
  if ((now - lastStatusMs) < 1000UL) return;
  lastStatusMs = now;
  bool statusOk = queryMipStatus(50);
  bool odomOk = false;
  if ((now - lastOdomPollMs) >= 1000UL) {
    lastOdomPollMs = now;
    odomOk = queryMipOdometer(50);
  }
  if (!statusOk && !odomOk && lastMipResponseMs > 0 && (now - lastMipResponseMs) > 5000UL) {
    if (mipRxOk) {
      mipRxOk = false;
      publishLog("WARNING", "MiP UART RX lost");
    }
  }
  updateOdometryFromMip();
  publishStatus();
  publishChargingLevel();
  publishWheelOdometry();
}

void periodicPublishTick() {
  unsigned long now = millis();
  if ((now - lastHeartbeatMs) >= 1000UL) {
    lastHeartbeatMs = now;
    publishHeartbeat();
  }
  if ((now - lastCapabilitiesMs) >= 3600000UL) {
    lastCapabilitiesMs = now;
    publishCapabilities();
    publishSoundboardFiles();
    publishChargingStatus();
  }
  if (MIP_CAMERA_ENABLED && videoEnabled && (now - lastVideoMs) >= MQTT_VIDEO_INTERVAL_MS) {
    lastVideoMs = now;
    publishVideoFrame();
  }
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(200);
  setupTopics();

  beginMipUart();
  mipGetUpEither();
  connectWifi();
  ensureTimeSync();
  configureMqttTls();
  mqtt.setServer(MQTT_HOST, MQTT_PORT);
  mqtt.setCallback(onMqttMessage);
  mqtt.setKeepAlive(MQTT_KEEPALIVE_SECONDS);
  mqttLargeBufferReady = mqtt.setBufferSize(MQTT_PACKET_BUFFER_SIZE);
  if (!mqttLargeBufferReady) {
    videoEnabled = false;
  }
  connectMqtt();
}

void loop() {
  if (WiFi.status() != WL_CONNECTED) {
    connectWifi();
  }
  if (!mqtt.connected()) {
    connectMqtt();
  }
  mqtt.loop();
  processMipIncoming(1);
  driveSafetyTick();
  telemetryTick();
  periodicPublishTick();
}
